# Fifa19 Exercise - Solutions

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [Fifa19 Dataset](https://www.kaggle.com/winterbreeze/fifa19eda) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('fifa_eda.csv')
df

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Preferred Foot,International Reputation,Skill Moves,Position,Joined,Contract Valid Until,Height,Weight,Release Clause
0,158023,L. Messi,31,Argentina,94,94,FC Barcelona,110500.0,565.0,Left,5.0,4.0,RF,2004,2021-01-01,5.583333,159.0,226500.0
1,20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,77000.0,405.0,Right,5.0,5.0,ST,2018,2022-01-01,6.166667,183.0,127100.0
2,190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,118500.0,290.0,Right,5.0,5.0,LW,2017,2022-01-01,5.750000,150.0,228100.0
3,193080,De Gea,27,Spain,91,93,Manchester United,72000.0,260.0,Right,4.0,1.0,GK,2011,2020-01-01,6.333333,168.0,138600.0
4,192985,K. De Bruyne,27,Belgium,91,92,Manchester City,102000.0,355.0,Right,4.0,4.0,RCM,2015,2023-01-01,5.916667,154.0,196400.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18202,238813,J. Lundstram,19,England,47,65,Crewe Alexandra,60.0,1.0,Right,1.0,2.0,CM,2017,2019-01-01,5.750000,134.0,143.0
18203,243165,N. Christoffersson,19,Sweden,47,63,Trelleborgs FF,60.0,1.0,Right,1.0,2.0,ST,2018,2020-01-01,6.250000,170.0,113.0
18204,241638,B. Worman,16,England,47,67,Cambridge United,60.0,1.0,Right,1.0,2.0,ST,2017,2021-01-01,5.666667,148.0,165.0
18205,246268,D. Walker-Rice,17,England,47,66,Tranmere Rovers,60.0,1.0,Right,1.0,2.0,RW,2018,2019-01-01,5.833333,154.0,143.0
18206,246269,G. Nugent,16,England,46,66,Tranmere Rovers,60.0,1.0,Right,1.0,2.0,CM,2018,2019-01-01,5.833333,176.0,165.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18207 entries, 0 to 18206
Data columns (total 18 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        18207 non-null  int64
 1   Name                      18207 non-null  object
 2   Age                       18207 non-null  int64
 3   Nationality               18207 non-null  object
 4   Overall                   18207 non-null  int64
 5   Potential                 18207 non-null  int64
 6   Club                      17966 non-null  object
 7   Value                     17955 non-null  float64
 8   Wage                      18207 non-null  float64
 9   Preferred Foot            18207 non-null  object
 10  International Reputation  18159 non-null  float64
 11  Skill Moves               18159 non-null  float64
 12  Position                  18207 non-null  object
 13  Joined                    18207 non-null  int64
 14  Contract Valid Until      17918 non-null  datetime64[ns]
 15  Height                    18207 non-null  float64
 16  Weight                    18207 non-null  float64
 17  Release Clause            18207 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(5), object(5)
memory usage: 2.5+ MB

In [7]:
df.columns

Index(['ID', 'Name', 'Age', 'Nationality', 'Overall', 'Potential', 'Club',
       'Value', 'Wage', 'Preferred Foot', 'International Reputation',
       'Skill Moves', 'Position', 'Joined', 'Contract Valid Until', 'Height',
       'Weight', 'Release Clause'],
      dtype='object')

In [9]:
df['Contract Valid Until']=pd.to_datetime(df['Contract Valid Until'],format='%Y-%m-%d')

**What is the mean & median Age ?**

In [14]:
df['Age'].describe()

count    18207.000000
mean        25.122206
std          4.669943
min         16.000000
25%         21.000000
50%         25.000000
75%         28.000000
max         45.000000
Name: Age, dtype: float64

**What is the greatest Height? and name of the player with that height?**

In [19]:
df[['Name','Height']][df['Height']==df['Height'].max()]

            Name  Height
11614    T. Holý    6.75
17927  D. Hodzic    6.75

**What is the smallest weight? and name of the player with that weight? and for which club plays?**

In [20]:
df[['Name','Club','Weight']][df['Weight']==df['Weight'].min()]

                Name             Club  Weight
13338  B. Al Mutairi         Al Batin   110.0
17157   K. Yamaguchi  Shonan Bellmare   110.0

**What is the position of Cristiano Ronaldo?**

In [22]:
df[['Name','Position']][df['Name']=='Cristiano Ronaldo']

                Name Position
1  Cristiano Ronaldo       ST

**What was the average (mean) Value of all players per year(Joined column) ?**

In [23]:
df.groupby('Joined')[['Value']].mean()

               Value
Joined
1991      160.000000
1998      106.666667
1999       40.000000
2000      110.000000
2001      237.500000
2002     2351.250000
2003     1148.076923
2004    10415.833333
2005     5544.705882
2006     1208.055556
2007     4730.789474
2008     5377.924528
2009     3468.269231
2010     5240.839695
2011     4868.241206
2012     3840.988201
2013     4181.320961
2014     3549.077017
2015     3335.755988
2016     2511.245432
2017     2125.398374
2018     1913.759519

**get Number of players for each club**

In [26]:
df.groupby('Club')[['ID']].count().sort_values(by='ID',ascending=False)

                   ID
Club
Borussia Dortmund  33
Tottenham Hotspur  33
Chelsea            33
Valencia CF        33
Everton            33
...                ..
Fluminense         20
Botafogo           20
Limerick FC        19
Sligo Rovers       19
Derry City         18

[651 rows x 1 columns]

**How many unique Clubs are there?**

In [27]:
df['Club'].nunique()

651

**What are the top 5 most common positions?**

In [30]:
df['Position'].value_counts().head(5)

Position
ST    2154
GK    2027
CB    1779
CM    1395
LB    1372
Name: count, dtype: int64

In [29]:
df.groupby('Position')[['ID']].count().sort_values(by='ID',ascending=False).head(5)

            ID
Position
ST        2154
GK        2027
CB        1779
CM        1395
LB        1372

**What are the top 5 most common nationality?**

In [31]:
df['Nationality'].value_counts().head(5)

Nationality
England      1662
Germany      1198
Spain        1072
Argentina     937
France        914
Name: count, dtype: int64

**What are the names of players has Egyptian Nationality?**

In [36]:
df['Name'][df['Nationality']=='Egypt']

26             M. Salah
752           Trezeguet
959           M. Elneny
1517          A. Hegazi
2241          A. Hassan
2259            Kahraba
2334           R. Sobhi
3310      A. Elmohamady
3616           A. Warda
3929          A. Ghazal
4044           A. Tarek
4217          Shikabala
4504         A. El Said
5614           A. Fathi
5913           M. Hamdy
5944           S. Morsy
6021          A. Ashraf
6407          S. Ekramy
6717            A. Gabr
6804           O. Gaber
7102     M. Abdul Shafy
8325          A. El-Abd
8441           T. Hamed
9165      M. El-Shenawy
9228        H. El Sayed
9297            M. Awad
9514        A. Jakobsen
9665           K. Hafez
9911          M. Mohsen
10672           M. Atwa
13891        A. Mostafa
Name: Name, dtype: object

**How many players joined in 2018 with skill moves=2?**

In [48]:
df['ID'][(df['Joined']==2018) & (df['Skill Moves']==2)].count()

3295

**How many players whom name starts with letter  'M'? (This is pretty tricky)**

In [57]:
M_list=[]
for c in df['Name']:
    if c.startswith('M'):
        M_list.append(c)
print(len(M_list))

1975

**Bonus: Is there a correlation between International Reputation and Wage?**

In [60]:
df[['International Reputation','Wage']].corr()

                          International Reputation      Wage
International Reputation                  1.000000  0.668635
Wage                                      0.668635  1.000000

---